; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v6)
		(pred_3 ?v8)
		(pred_1 ?v4)
		(pred_6 ?v4)
		(pred_4 ?v8 ?v4)
		(pred_5)
		(pred_2 ?v8))

   (:action op_2
       :parameters  (?v1 ?v5)
       :precondition (and (not-eq ?v1 ?v5) 
                          (pred_1 ?v1) (pred_1 ?v5) (pred_6 ?v1))
       :effect (and  (pred_6 ?v5)
		     (not (pred_6 ?v1))))


   (:action op_1
       :parameters (?v7 ?v3)
       :precondition  (and  (pred_3 ?v7) (pred_1 ?v3)
			    (pred_4 ?v7 ?v3) (pred_6 ?v3) (pred_5))
       :effect (and (pred_2 ?v7)
		    (not (pred_4 ?v7 ?v3)) 
		    (not (pred_5))))

   (:action op_3
       :parameters  (?v7  ?v3)
       :precondition  (and  (pred_3 ?v7) (pred_1 ?v3)
			    (pred_2 ?v7) (pred_6 ?v3))
       :effect (and (pred_4 ?v7 ?v3)
		    (pred_5)
		    (not (pred_2 ?v7)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_08 obj_06 obj_03 obj_01 obj_02 obj_04 
          obj_05 obj_07 
)
(:init
(pred_1 obj_08)
(pred_1 obj_06)
(pred_1 obj_03)
(pred_1 obj_01)
(pred_1 obj_02)
(pred_1 obj_04)
(pred_3 obj_05)
(pred_3 obj_07)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(pred_5)
(pred_4 obj_05 obj_06)
(pred_4 obj_07 obj_04)
(pred_6 obj_06)
)
(:goal
(and
(pred_4 obj_05 obj_01)
(pred_4 obj_07 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_05 obj_01) (pred_6 obj_08))
    (sometime-before  (pred_4 obj_07 obj_06) (pred_6 obj_08))
  )
)
)

; plan
1. (op_2 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 0 of 2
2. (op_1 obj_07 obj_04)
   deleted: (pred_4 obj_07 obj_04) (pred_5)
   added: (pred_2 obj_07)
   goals met: 0 of 2
3. (op_2 obj_04 obj_08)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_08)
   goals met: 0 of 2
4. (op_3 obj_07 obj_08)
   deleted: (pred_2 obj_07)
   added: (pred_4 obj_07 obj_08) (pred_5)
   goals met: 0 of 2
5. (op_2 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 0 of 2
6. (op_1 obj_05 obj_06)
   deleted: (pred_4 obj_05 obj_06) (pred_5)
   added: (pred_2 obj_05)
   goals met: 0 of 2
7. (op_2 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_01)
   goals met: 0 of 2
8. (op_3 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_4 obj_05 obj_01) (pred_5)
   goals met: 1 of 2
9. (op_2 obj_01 obj_08)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_08)
   goals met: 1 of 2
10. (op_1 obj_07 obj_08)
   deleted: (pred_4 obj_07 obj_08) (pred_5)
   added: (pred_2 obj_07)
   goals met: 1 of 2
11. (op_2 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 1 of 2
12. (op_3 obj_07 obj_06)
   deleted: (pred_2 obj_07)
   added: (pred_4 obj_07 obj_06) (pred_5)
   goals met: 2 of 2
